{
  "language": "Tiếng Việt",
  "menu-index": "Trang chủ",
  "menu-tutorials": "Bài giảng",
  "menu-events": "Sự kiện",
  "menu-chapters": "Các chapter",
  "menu-about": "Giới thiệu",
  "menu-building-workshops": "Cống hiến",
  "menu-host": "Tổ chức",
  "about-h1": "NodeSchool là gì?",
  "about-header": "NodeSchool là một dự án mã nguồn mở được thực hiện bởi các tình nguyện viên từ khắp nơi trên thế giới với 2 mục tiêu chính: xây dựng một chương trình dạy lập trình chất lượng cao và tổ chức các sự kiện học tập cộng đồng.",
  "about-header-history-title": "Các bài học tương tác",
  "about-history": "Mùa hè năm 2013, <a href=\"http://substack.net/\">Substack of the Internet</a> đã tạo ra &quot;workshopper&quot; nền tảng đầu tiên là <a href=\"https://www.npmjs.org/package/stream-adventure\">stream-adventure</a>.",
  "about-history2": "Các workshopper đều được hoạt động trên nguyên tắc tương tác động và hoàn toàn tự động. Chúng được xây dựng bằng một loạt các bài tập được sắp xếp theo độ phức tạp tăng dần. Với mỗi bài tập, đầu tiên các khái niệm lý thuyết sẽ được giải thích, sau đó có các nhiệm vụ với các điều kiện ràng buộc tương ứng để vận dụng lý thuyết được trình bày. Người học sẽ thực hành bằng cách giải quyết các nhiệm vụ ở mỗi bài tập đó.",
  "about-history3": "Khi người học cảm thấy chắc chắn về bài giải của mình thì họ có thể gửi bài đó cho chương trình kiểm tra. Lúc đó, chương trình sẽ chạy bài giải của họ và kiểm tra các điều kiện ràng buộc cũng như kết quả đầu ra để đánh giá. Nếu bài đó chưa đúng thì nó sẽ chỉ ra cho người học những thông tin hữu ích về bài chưa đúng đó, sau đó người học có thể gửi lại kết quả sau khi đã sửa các lỗi gặp phải. Còn nếu chương trình của người học đã đúng thì họ sẽ được thông báo là đã qua bài đó, lúc đó người học có thể làm bài tập tiếp theo.",
  "about-history4": "Tất cả các việc này đều được tự động hoá toàn bộ. Bạn có thể tưởng tượng rằng, các workshopper được hoạt động như các Unit Test, nó sẽ kiểm tra chương trình mà bạn viết ra để đánh giá là đúng hay chưa đúng.",
  "about-header-philosophy-title": "Chủ đề đa dạng",
  "about-philosophy": "Tất cả các bài giảng - workshop đều được xây dựng bằng Node, nhưng chúng không nhất thiết phải liên quan tới Node mà ở nhiều chủ để khác nhau. Ví dụ, bài giảng <a href=\"https://www.npmjs.org/package/shader-school\">shader-school</a> dạy về các khái niệm đồ hoạ máy tính chứ chẳng liên quan gì tới Node hay JavaScript cả.",
  "about-philosophy2": "Cộng đồng NodeSchool đã và đang phát triển nhiều công cụ hữu ích làm nền tảng xây dựng các bài giảng cũng như xây dựng ngày càng nhiều các bài giảng hấp dẫn hơn, hiệu quả hơn cho nhiều đối tượng khác nhau. Nếu bạn có ý tưởng xây dựng nền tảng, hay bài giảng nào đó thì đóng góp bài giảng cho cộng đồng. Để xây dựng bài giảng, bạn có thể xem thêm hướng dẫn tại trang <a href=\"building-workshops.html\">xây dựng bài giảng</a>.",
  "about-header-info-title": "Các sự kiện trên thế giới",
  "about-info": "Hiện tại cộng đồng NodeSchool đã lan tới tất cả các châu lục, trừ châu Nam Cực. Vì bất cứ ai, tại bất cứ đâu cũng có thể tham gia vào cộng đồng, mở các sự kiện với nhiều chỉ dẫn cũng như nhiều thông tin, kinh nghiệm tổ chức trên nhiều quốc gia mà cộng đồng NodeSchool ngày càng rộng lớn và vững mạnh hơn. Bạn có thể xem phần <a href=\"host.html\">mở nhóm</a> để biết thêm về cách mở một nhóm ra sao.",
  "about-header-touch-title": "Luôn giữ liên lạc",
  "about-info2": "Chúng tôi dùng GitHub để tổ chức NodeSchool. Bạn có thể liên lạc với chúng tôi bằng cách mở một Issue tại <a href=\"https://github.com/nodeschool/organizers/issues\">organizers repository</a>. Sau khi nhận được liên lạc, chúng tôi sẽ cố gắng trả lời bạn một cách nhanh nhất có thể. Với cách này chúng tôi dễ dàng theo dõi và kiểm soát các vấn đề hơn là sử dụng email.",
  "about-header-talk-title": "Mọi người nói gì về NodeSchool?",
  "about-info3": "Ở <a href=\"https://archive.org/details/NodeUp55\" target=\"_blank\">episode 55</a> của NodeUp podcast, Mikeal Rogers, Max Ogden và các thành viên khác của cộng đồng đã nói về NodeSchool. Tại Cascadia JS 2014, Jason Rhodes (Baltimore) đã <a href=\"https://www.youtube.com/watch?v=YJ7txKTh3-E\" target=\"_blank\">nói về việc tổ chức NodeSchool</a>.",
  "footer-contact-header": "Liên hệ",
  "footer-contribute-header": "Đóng góp",
  "footer-contribute-question": "Mở một Issue",
  "footer-contribute-answer": "Trả lời câu hỏi",
  "footer-about-header": "Giới thiệu",
  "footer-about-build": "Xây dựng bài giảng",
  "footer-about-host": "Tổ chức workshop",
  "building-workshops-header": "Xây dựng một NodeSchool Workshop",
  "building-workshops-subtitle": "Dưới đây là các công cụ cơ bản được sử dụng làm nền tảng xây dựng các workshop.",
  "building-workshops-title-info": "<a href=\"https://www.npmjs.org/package/workshopper\">workshopper</a>",
  "building-workshops-info": "để cài đặt framework workshop CLI chung của nodeschool.",
  "building-workshops-title-info2": "<a href=\"https://www.npmjs.org/package/adventure\">adventure</a>",
  "building-workshops-info2": "để cài đặt framework nhẹ hơn thay thế cho workshopper.",
  "building-workshops-title-info3": "Xây dựng workshop",
  "building-workshops-info3": "Với 1 trong 2 bộ framework trên bạn có thể tự xây dựng bài giảng về JavaScript. Nhưng nếu bạn muốn xây dựng bài giảng liên quan tới CSS thì bạn cần tự xây dựng bộ hỗ trợ CSS riêng. Ví dụ, mô-đun",
  "building-workshops-info3A": "được sử dụng để xây dựng workshop",
  "building-workshops-info3B": ".",
  "chapters-h1": "Danh sách các Chapter",
  "chapters-header": "Đây là danh sách các thành phố đang tổ chức các sự kiện thường kì. Bạn có thể xem <a href=\"hexdex.html\">hexdex logo</a> của các thành phố.",
  "index-chapter-list-loading": "Đang tải...",
  "chapters-other": "Những nơi khác?",
  "chapters-start": "Bạn không tìm thấy NodeSchool chapter ở nơi của bạn?",
  "chapters-start2": "Có thể mở một issue tại mục thảo luận",
  "chapters-start3": "để tìm những người quanh bạn. Nếu chưa có chapter nào thì bạn có thể mở một chapter! Để mở một chapter, bạn có thể xem hướng dẫn tại",
  "chapters-start4": "đây",
  "chapters-start5": ".",
  "events-header": "Các sự kiện NodeSchool đã và sắp diễn ra",
  "events-past": "Đã kết thúc",
  "events-future": "Sắp diễn ra",
  "events-header2": "Hiện có tất cả <strong><span id=\"event-count\">many</span></strong> sự kiện!",
  "events-header3": "Nếu bạn là người tổ chức sự kiện thì hãy thông báo cho mọi người biết ở đây bằng cách điền vào <a href=\"https://docs.google.com/forms/d/1vYW-Yw82kt_q7WDgBY6gQqFrg3zuD2rDPXEG-cbq7e4/viewform?usp=form_confirm\" target=\"_blank\">bản đăng kí này</a>.",
  "events-small": "Nếu bạn cần chỉnh sử nội dung bạn đã thông báo thì hãy thông báo bằng cách tạo <a href=\"https://github.com/nodeschool/organizers/issues/new\">một Issue tại nodeschool/organizers.</a>",
  "calendar-h1": "Lịch",
  "hexdex-h1": "Hexdex",
  "hexdex-header": "Đây là các logo hexagons của <a href=\"chapters.html\">các chapter NodeSchool</a>.",
  "hexdex-make-logo": "Bạn có thể tạo logo cho chapter của bạn theo <a href=\"https://github.com/nodeschool/nodeschool.github.io/tree/master/images/make-a-sticker\">mẫu này</a>.",
  "host-header": "Tổ chức một sự kiện NodeSchool",
  "host-info": "NodeSchool là dự án mã nguồn mở được thực hiện dựa trên sự nỗ lực chung của cả cộng đồng. Điều đó có nghĩa là bất kì ai cũng có thể sử dụng các tài liệu của NodeSchool cũng như mở các sự kiện tại bất kì đâu.",
  "host-info-cost": "Mong đợi duy nhất đối với người tổ chức là các sự kiện này phải phi lợi nhuận (miễn phí hoặc rất rẻ) và sự quản trị sự kiện trên tinh thần mở (để không ai có thể 'kiểm soát' các sự kiện)",
  "host-info-wiki": "Chúng tôi đã tạo ra <a href='https://github.com/nodeschool/organizers/wiki'>Wiki cho người tổ chức</a> để lưu giữ tất cả kiến thức từ các chapter trên thế giới.",
  "host-info-wiki-link": "Hãy xem <a href='https://github.com/nodeschool/organizers/wiki'>trang wiki</a> để biết lập một chapter như thế nào, cách tổ chức một event thành công và xây dựng cộng đồng NodeSchool địa phương!",
  "index-header-top": "Các workshop mã nguồn mở dạy về lập trình web. Hãy tự học hoặc tham gia các lớp gần nhất.",
  "index-header-bottom": "Bắt đầu bằng cách cài đặt một trong các",
  "index-header-bottomA": "workshop cơ bản",
  "index-header-bottomB": "hoặc đăng kí để theo dõi thông tin qua",
  "index-header-bottomC": "bản tin email",
  "index-workshop-header": "Workshops",
  "index-workshop-info": "Đây là các workshop được tổ chức trực tiếp, thường miễn phí, nội dung dạy là các workshopper và có người hướng dẫn giúp người tham gia giải quyết các thử thách.",
  "index-workshop-links-host": "Tự tổ chức tại thành phố của bạn",
  "index-workshop-links-events": "Xem tất cả các sự kiện",
  "index-workshop-links-writeups": "Về các sự kiện đã diễn ra",
  "index-upcoming-header": "Workshop sắp tới",
  "index-upcoming-loading": "Đang tải...",
  "index-upcoming-no-events": "Chưa có sự kiện nào sắp diễn ra. Xem thêm",
  "index-upcoming-past-events": "các sự kiện đã kết thúc",
  "index-upcoming-past-events2": "!",
  "index-upcoming-all-events": "Xem tất cả các sự kiện",
  "index-upcoming-error": "Xin lỗi, tải các sự kiện gặp vấn đề!",
  "index-host-header": "Bất kì ai cũng có thể tự tổ chức",
  "index-host-past": "Đã có tổng cộng",
  "index-host-past2": "sự kiện!",
  "index-host-want-to-host": "NodeSchool là một cộng đồng mã nguồn mở, phi tập trung và được vận hành bởi các tình nguyện viên từ khắp nơi trên thế giới. Bạn muốn tự tổ chức sự kiện của mình?",
  "index-host-want-to-host2": "Xem tài liệu và hướng dẫn ở đây",
  "index-host-want-to-host3": "để biết thêm chi tiết.",
  "index-workshopper-header": "Workshoppers",
  "index-workshopper-info": "Workshopper là tên chung cho các bài học mã nguồn mở của NodeSchool. Tất cả chúng được xây dựng trên nguyên tắc có thể tự học (tức là bạn không cần phải tới sự kiện nào đó mới có thể học được) và hầu hết là offline.",
  "index-workshopper-list-view": "Xem danh sách các Workshopper",
  "index-workshopper-list-problem": "Đặt câu hỏi khi gặp khó khăn",
  "index-workshopper-list-faq": "Trả lời các câu hỏi",
  "index-workshopper-list-host": "Xây dựng Workshop",
  "index-get-going-header": "Bắt đầu thế nào?",
  "index-get-going-info": "Bạn cần cài đặt",
  "index-get-going-info2": "để có thể sử dụng các workshopper ở đây. Sau đó dùng",
  "index-get-going-info3": "(được cài sẵn với Node) để cài đặt workshopper với câu lệnh phía dưới nó. Sau khi cài xong, bạn chỉ cần gõ tên của workshopper là có thể bắt đầu",
  "index-get-going-editor": "Ngoài ra, để lập trình bạn cần một",
  "index-get-going-editor2": "trình soạn thảo - Text Editor",
  "index-get-going-editor3": ", nếu bạn chưa có thì nên chọn trình soạn thảo chuyên cho lập trình. Một số lựa chọn phù hợp:",
  "index-get-going-editor4": ",",
  "index-get-going-editor5": ",",
  "index-get-going-editor6": ",",
  "index-get-going-editor7": ".",
  "index-workshoppers-core-header": "Cơ bản",
  "index-workshoppers-core-info": "Các workshopper này tập trung vào các kĩ năng cơ bản nhất để có thể làm việc với Node.js.",
  "index-workshoppers-core-link-pre": "Gặp khó khăn? Hãy đặt một câu hỏi tại",
  "index-workshoppers-core-link-text": "mục thảo luận",
  "index-workshoppers-core-link-post": ".",
  "workshopper-javascripting": "Cơ bản về JavaScript. Không yêu cầu kinh nghiệm lập trình.",
  "workshopper-gitit": "Cơ bản về Git và GitHub.",
  "workshopper-scope-chains-closures": "Tìm hiểu chi tiết về Scope, Scope Chains, Closures và trình dọn rác GC.",
  "workshopper-elementary-electron": "Tạo ứng dụng cho desktop bằng Node và Chromium với Electron.",
  "workshopper-learnyounode": "Cơ bản về node: xuất nhập bất đồng bộ (asynchronous i/o), http.",
  "workshopper-how-to-npm": "Học cách sử dụng và tạo các mô-đun npm.",
  "workshopper-streamadventure": "Học cách điều phối, sử dụng các dòng dữ liệu (stream) với",
  "workshopper-streamadventure2": ".",
  "workshopper-how-to-markdown": "Học cách sử dụng mã Markdown - một ngôn ngữ đánh dấu văn bản gọn nhẹ và tiện lợi.",
  "index-workshoppers-elective-header": "Tùy chọn",
  "index-workshoppers-elective-info": "Bao gồm các workshoppers về các thư viện, framework, phong cách lập trình với JavaScript, Node.js.",
  "index-workshoppers-elective-link-pre": "Gặp khó khăn? Hãy đặt một câu hỏi tại",
  "index-workshoppers-elective-link-text": "mục thảo luận",
  "index-workshoppers-elective-link-post": ".",
  "workshopper-functionaljavascript": "Học cơ bản về lập trình hàm với JavaScript - ES5.",
  "workshopper-levelmeup": "Học cách sử dụng leveldb - một bộ lữu trữ đơn giản dạng key/value đang rất hot.",
  "workshopper-expressworks": "Học cơ bản về framework Express.js - một framework lập trình Web hiệu quả.",
  "workshopper-makemehapi": "Làm chủ hapi qua các bài tập.",
  "workshopper-promise-it-wont-hurt": "Học cách sử dụng promises trong JavaScript để xử lý các thao tác bất đồng bộ.",
  "workshopper-async-you": "Học cách sử dụng gói bất đồng bộ - async package.",
  "workshopper-nodebot-workshop": "Tạo robot với johnny-five api.",
  "workshopper-goingnative": "Thăm dò Node.js từ nền tảng: native C++ add-ons.",
  "workshopper-planetproto": "Hiểu hơn về Prototypes trong JavaScript ",
  "workshopper-webgl-workshop": "Học cơ bản về WebGL.",
  "workshopper-esnext-generation": "Giới thiệu Iterators trong ES6 và mối liên hệ với Generators.",
  "workshopper-test-anything": "Học cách kiểm thử mã",
  "workshopper-tower-of-babel": "Nhập môn ES6 với một tập các bài thực hành hấp dẫn.",
  "workshopper-learnyoumongo": "Bắt đầu với MongoDB và Node.js.",
  "workshopper-regex-adventure": "Phân tích các text với biểu thức chính quy - regular expressions",
  "workshopper-learn-sass": "Cơ bản về SASS",
  "workshopper-pattern-lab-workshop": "Cơ bản về Pattern Lab.",
  "workshopper-learnyoubash": "Học cách sử dụng terminal và tạo chương trình Bash Script cơ bản.",
  "workshopper-currying": "Tìm hiểu khái niệm currying và cách tạo các hàm currying với JavaScript.",
  "workshopper-shader-school": "Học cơ bản về lập trình đồ họa với GLSL shaders.",
  "workshopper-bytewiser": "Học cách thao tác với dữ liệu nhị phân (binary data) trong node.js và trình duyệt HTML5.",
  "workshopper-bug-clinic": "Học một vài công cụ, kĩ thuật mới để nâng cao kĩ năng gỡ lỗi (debug).",
  "workshopper-browserify-adventure": "Sử dụng các mô-đun của Nodejs trên trình duyệt với browserify.",
  "workshopper-introtowebgl": "Làm quen với three.js và WebGL.",
  "workshopper-count-to-6": "Học cách sử dụng một vài tính năng mới của ES6, phiên bản tiếp theo của JavaScript.",
  "workshopper-kick-off-koa": "Cơ bản về Koa, thế hệ framework web tiếp theo cho Node.js.",
  "workshopper-lololodash": "Học về Lo-Dash (fork từ underscore) để thao tác với mảng và đối tượng dễ dàng hơn!",
  "workshopper-learnyoucouchdb": "Học về CouchDB - một cơ sở dữ liệu hấp dẫn cho các trang web",
  "workshopper-learnuv": "Học về uv - một thư viện đa nền I/O bất đồng bộ rất hay và tiện lợi.",
  "workshopper-learn-generators": "Làm quen với Generators trong JavaScript ES6.",
  "workshopper-learnyoureact": "Cùng học React.js và tạo UI từ phía server nhé!",
  "workshopper-perfschool": "Ma thuật tối ưu hiệu năng cho trang web!",
  "workshopper-web-audio-school": "Học API của Web Audio với một chuỗi các bài học tương tác tập trung vào âm nhạc.",
  "workshopper-torrential": "Một tập các bài học giúp bạn tạo được một mạng p2p bittorrent đơn giản.",
  "workshopper-thinking-in-react": "Học các triết lý của React bằng cách xây dựng UI từ đầu.",
  "workshopper-node-debug-school": "Học cách sử dụng post-mortem để debug trên SmartOS một cách hiệu quả cho các ứng dụng Node.js.",
  "workshopper-seneca-in-practice": "Học về microservice toolkit."
}
